PLOGHELP QUIETSPY                            Simon Nichols, October 1990

    ?- quietspy(on).
    ?- quietspy(off).
    ?- quietspy(Status).

When you set or remove a spy-point, spy and nospy print a message:

    ?- spy append.
    Spypoint placed on append/3
    yes

    ?- nospy.
    Spypoint removed from append/3
    yes

You can disable these messages by means of the evaluable predicate
quietspy/1:

    ?- quietspy(on).
    yes

    ?- spy(append).
    yes

    ?- nospy(append).
    yes

This is especially useful if you want to set spy-points on a large
number of predicates.

To re-enable the messages, invoke quietspy/1 with an argument of 'off':

    ?- quietspy(off).
    yes

To find out whether messages are on or off, invoke quietspy/1 with a
variable as argument:

    ?- quietspy(Status).
    Status = on ?
    yes

Note that quietspy/1 does not affect the debugging messages produced at
spy-points. See PLOGHELP * SPY for information about the SPY debugging
package.


-- RELATED DOCUMENTATION ----------------------------------------------

PLOGHELP * DEBUG
 Overview of the debugging facilities provided by POPLOG Prolog

PLOGHELP * DEBUGGING
 Predicate which lists currently active spy-points

PLOGHELP * LEASH
 Predicate which enables user interaction at spy-points

PLOGHELP * NODEBUG
 Predicate which removes all current spy-points

PLOGHELP * NOSPY
 Predicate which removes spy-points from specified predicates

PLOGHELP * SPY
 How to set spy-points on predicates in order to debug them

PLOGHELP * UNLEASH
 Predicate which disables user interaction at spy-points


--- C.all/plog/help/quietspy
--- Copyright University of Sussex 1990. All rights reserved. ----------
